app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def new
    @comment = Comment.new
    @comment.post = Post.find(params[:post_id])

INSERT INTO "comments" ("body", "post_id") VALUES('skldjfhskdjfhskdjfhsk
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save