app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("created_at", "updated_at", "user_id", "friend_id") VALUES('2010-09-19 16:48:27', '2010-09-19 16:48:27', 2, 1)
---
      def create
       @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
       if @friendship.save