app/controllers/posts_controller.rb

     def index
       @posts = Post.all(:order => "created_at DESC")
---
SELECT * FROM "posts" ORDER BY created_at DESC

     def create
       @post = Post.create(:message => params[:message])
---
INSERT INTO "posts" ("created_at", "updated_at", "message") VALUES('2010-09-18 06:18:15', '2010-09-18 06:18:15', 'Whoa finally did something fruitful !!')