app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "password_hash", "email") VALUES('2010-09-18 10:58:08', '2010-09-18 10:58:08', 'sandeep', 'a75b0d5c1d4e1220fda3aea71d59b2d3ed87c423', '61fd24ea5b5332e29e4bc828c8929975698bf1df', 'sandeepappala04@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save